Sources/interTwoPhaseCentralFoam/tutorial/GasWater/constant/centrotechCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      SprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/// settings for solving of particles equations
solution
{
    active                      false;
    coupled                     true;
    transient                   true;
    cellValueSourceCorrection   false;
    maxCo                       0.3;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               semiImplicit 1;
            Yi              semiImplicit 1;
            h               semiImplicit 1;
            radiation       explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cell;
        thermo:mu.gas   cell;
        T.gas           cell;
        Cp              cell;
        kappa           cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               Euler;
    }
}

/// description of initial properties of particles
constantProperties
{
    T0              300.0;
    rho0            824;
    Cp0             4179; 

    constantVolume  false;
}


subModels
{
    /// list of forces acting on a particle

    particleForces {}

    /// how to add particles into the flow domain

    injectionModels {}

    /// interaction between particles and patches

    patchInteractionModel localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            outlet
            {
                type escape;
            }

            inlet
            {
                type escape;
            }

            wall
            {
                type        rebound; //stick, escape
                e           0.1;     // normal velocity component
                mu          0;       // tangential velocity component
            }
            
            defaultFaces
            {
                type escape;
            }

        );
    }

    /// description of mixture in the continuous phase

    compositionModel    singlePhaseMixture;

    singlePhaseMixtureCoeffs
    {
        phases
        (
            gas
            {
                gas 1; // specie fraction
            }
        );
    }

    /// heat transfer model

    heatTransferModel none; 

    /// radiation model

    radiation       off;

    /// droplet breakup model 

    breakupModel   none;

    /// phase change model (evaporation)

    phaseChangeModel none;

    /// turbulent dispertion model

    dispersionModel none;

    /// stochastic collision model
    
    stochasticCollisionModel none;
    
    /// interaction between particles and surface film

    surfaceFilmModel none;

    /// model of jet atomization

    atomizationModel none;
}

/// cloud function objects
cloudFunctions
{}


// ************************************************************************* //
