Sources/interTwoPhaseCentralFoam/tutorial/GasWater/constant/reactions
species
(
    gas
);

reactions
{
}
