Sources/interTwoPhaseCentralFoam/tutorial/GasWater/constant/thermophysicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectFluid;
    specie          specie;
    energy          sensibleEnthalpy;
}


mixture
{
    specie
    {
        molWeight   1.301;//18.015;
    }
    equationOfState
    {
        R            6387.8;//461.5;//7719.6;//6387.8;
        rho0         999.5;
    }
    thermodynamics
    {
        Cp              4186;
        Hf              0.0;
    }
    transport
    {
        mu              0.0;//1e-3;
        Pr              0.73;//6.75;
    }

}


// ************************************************************************* //
